//ЦИКЛЫ

/*for (i= 0; i<10; i++) {
  console.log(i);
}*/

/*for (i=1; i<=10; i++) {
  console.log(i);
}*/

/*let i = 1;
while (i < 11) {
  console.log(i + "");
  i++;
}*/

/*i = 1;
do {
  console.log(i);
  i++;
} while (i < 11);*/

//-------------------------------------

/*for (i=1; i<21; i++) {
  if (i % 2 == 0) continue;
  else console.log(i + "");
}
Выдаёт нечётные числа от 1 до 20
continue - прерывает выполнение текущей итерации*/

/*for (i=1; i<11; i++) {
  if (i == 5) break;
  console.log(i + "");
}*/
//Выдаёт числа от 1 до 4
//break - прерывает выполнение цикла полностью


/*for (let j = 1; j < 15; j++) {
  console.log("*".repeat(j));
} */
//Выдаёт треугольник из звёздочек
//repeat - повторяет строку заданное количество раз


//-------------------------------------

