//ЦИКЛЫ

/*for (i= 0; i<10; i++) {
  console.log(i);
}*/

/*for (i=1; i<=10; i++) {
  console.log(i);
}*/

/*let i = 1;
while (i < 11) {
  console.log(i + "");
  i++;
}*/

/*i = 1;
do {
  console.log(i);
  i++;
} while (i < 11);*/

//-------------------------------------

/*for (i=1; i<21; i++) {
  if (i % 2 == 0) continue;
  else console.log(i + "");
}
Выдаёт нечётные числа от 1 до 20
continue - прерывает выполнение текущей итерации*/

/*for (i=1; i<11; i++) {
  if (i == 5) break;
  console.log(i + "");
}*/
//Выдаёт числа от 1 до 4
//break - прерывает выполнение цикла полностью


/*for (let j = 1; j < 15; j++) {
  console.log("*".repeat(j));
} */
//Выдаёт треугольник из звёздочек
//repeat - повторяет строку заданное количество раз


//-------------------------------------

// МАССИВЫ


/*let M = [9, 11, 7, 4, 99, 3, 2, 33, 3];

let Min = M[0];
let Min_ind = 0;

console.log("Массив:", M);

for (let i = 1; i < M.length; i++) {
  if (M[i] < Min) {
    Min = M[i];
    Min_ind = i;
  }
}

console.log("Минимальный элемент:", Min);
console.log("Индекс минимального элемента:", Min_ind); */

//Находит минимальный элемент массива и его индекс



/*
// Двумерный массив (матрица)
// Каждый элемент M — это отдельный массив (строка)
let M = [
  [3, 2, 1],
  [7, 8, 9],
  [5, 6, 7]
];

// Предполагаем, что максимальный элемент первый элемент первой строки массива
let Max = M[0][0];

// Переменные для хранения индексов строки и столбца максимального элемента
let maxRow = 0;
let maxCol = 0;

// Внешний цикл — перебор строк массива
for (let i = 0; i < M.length; i++) {

  // Внутренний цикл — перебор элементов в строке
  for (let j = 0; j < M[i].length; j++) {

    // Сравниваем текущий элемент с текущим максимумом
    if (M[i][j] > Max) {

      // Если нашли больший элемент обновляем значение максимума
      Max = M[i][j];

      // Сохраняем индекс строки
      maxRow = i;

      // Сохраняем индекс столбца
      maxCol = j;
    }
  }
}

console.log("Максимальный элемент:", Max);
// Выводим его индекс в формате [строка][столбец]
console.log(`Индекс: [${maxRow}][${maxCol}]`); */



//______________________________________________________
// ФУНКЦИИ

/*
let sum = function (a, b) {return a + b;};
let x = sum(5, 7);
console.log(x); // 12
*/


/*
function map(f, a) {
  let resFunc = []; // Новый массив для результатов
  let i; // Счётчик цикла
  for (i = 0; i != a.length; i++)
    resFunc[i] = f(a[i]);
  return resFunc;
}
let f = function (z) {
  return z * z * z;
}
let nums = [0,5,7,9,12];
let cube = map(f, nums);
console.log(cube); */

// [0, 125, 343, 729, 1728]
// Возводит каждый элемент массива в куб



//______________________________________________________
// РЕКУРСИЯ


/*
function f_factorial(x) {
  if (x == 0 || x == 1) return 1; // Базовый случай
  else return (x * f_factorial(x - 1)); // Рекурсивный случай
}
let n = 5;
let result = f_factorial(n); // Вызов функции
console.log(`Факториал числа ${n} равен ${result}`); */
// Факториал числа 5 равен 120


